Revit 2027 API
ConstraintToRebarEdgeProperties(Rebar, Int32) Constructor
 Constructs a new instance of ConstraintToRebarEdgeProperties.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConstraintToRebarEdgeProperties(
	Rebar targetRebar,
	int targetEgeIndex
)
Public Sub New (
	targetRebar As Rebar,
	targetEgeIndex As Integer
)
public:
ConstraintToRebarEdgeProperties(
	Rebar^ targetRebar,
	int targetEgeIndex
)
new :
        targetRebar : Rebar *
        targetEgeIndex : int -> ConstraintToRebarEdgeProperties
Parameters
targetRebar Rebar
 The target Rebar
targetEgeIndex Int32
 Identifies the index of the target Rebar's edge. The index should be between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in the target set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  targetEgeIndex is not a valid edge index for the rebar. It should be between 0 and centerlines.Count - 1, where centerlines are computed by suppressing hooks, cranks and fillets for the first bar in set.
See Also
Reference
ConstraintToRebarEdgeProperties Class
ConstraintToRebarEdgeProperties Overload
Autodesk.Revit.DB.Structure Namespace